{
  "stoi": {
    "+": 0,
    "+++": 1,
    "++-": 2,
    "++o": 3,
    "+-+": 4,
    "+--": 5,
    "+-o": 6,
    "+o+": 7,
    "+o-": 8,
    "+oo": 9,
    "-++": 10,
    "-+-": 11,
    "-+o": 12,
    "--+": 13,
    "---": 14,
    "--o": 15,
    "-o+": 16,
    "-o-": 17,
    "-oo": 18,
    "0": 19,
    "1": 20,
    "10": 21,
    "11": 22,
    "12": 23,
    "13": 24,
    "14": 25,
    "15": 26,
    "16": 27,
    "17": 28,
    "18": 29,
    "19": 30,
    "2": 31,
    "3": 32,
    "4": 33,
    "5": 34,
    "6": 35,
    "7": 36,
    "8": 37,
    "9": 38,
    "<": 39,
    ">": 40,
    "Ac": 41,
    "Ag": 42,
    "Al": 43,
    "Ar": 44,
    "As": 45,
    "Au": 46,
    "B": 47,
    "BBB": 48,
    "BBO": 49,
    "BFF": 50,
    "Ba": 51,
    "Be": 52,
    "Bi": 53,
    "Br": 54,
    "C": 55,
    "Ca": 56,
    "Cd": 57,
    "Ce": 58,
    "Cl": 59,
    "Co": 60,
    "Cr": 61,
    "Cs": 62,
    "Cu": 63,
    "DDB": 64,
    "DDD": 65,
    "DDF": 66,
    "DDO": 67,
    "DOB": 68,
    "DOD": 69,
    "DOF": 70,
    "DOO": 71,
    "Dy": 72,
    "ECC": 73,
    "Er": 74,
    "Eu": 75,
    "F": 76,
    "FBB": 77,
    "FBF": 78,
    "Fe": 79,
    "Ga": 80,
    "Gd": 81,
    "Ge": 82,
    "H": 83,
    "He": 84,
    "Hf": 85,
    "Hg": 86,
    "Ho": 87,
    "I": 88,
    "In": 89,
    "Ir": 90,
    "K": 91,
    "Kr": 92,
    "La": 93,
    "Li": 94,
    "Lu": 95,
    "Mg": 96,
    "Mn": 97,
    "Mo": 98,
    "N": 99,
    "Na": 100,
    "Nb": 101,
    "Nd": 102,
    "Ne": 103,
    "Ni": 104,
    "Np": 105,
    "O": 106,
    "OBB": 107,
    "OBZ": 108,
    "ODB": 109,
    "ODD": 110,
    "ODO": 111,
    "OOB": 112,
    "OOC": 113,
    "OOD": 114,
    "OOE": 115,
    "OOO": 116,
    "OYZ": 117,
    "Os": 118,
    "P": 119,
    "Pa": 120,
    "Pb": 121,
    "Pd": 122,
    "Pm": 123,
    "Pr": 124,
    "Pt": 125,
    "Pu": 126,
    "Rb": 127,
    "Re": 128,
    "Rh": 129,
    "Ru": 130,
    "S": 131,
    "Sb": 132,
    "Sc": 133,
    "Se": 134,
    "Si": 135,
    "Sm": 136,
    "Sn": 137,
    "Sr": 138,
    "Ta": 139,
    "Tb": 140,
    "Tc": 141,
    "Te": 142,
    "Th": 143,
    "Ti": 144,
    "Tl": 145,
    "Tm": 146,
    "U": 147,
    "V": 148,
    "W": 149,
    "Xe": 150,
    "Y": 151,
    "YBO": 152,
    "YBY": 153,
    "YYO": 154,
    "YYY": 155,
    "Yb": 156,
    "ZZZ": 157,
    "Zn": 158,
    "Zr": 159,
    "a": 160,
    "b": 161,
    "c": 162,
    "d": 163,
    "e": 164,
    "f": 165,
    "g": 166,
    "h": 167,
    "i": 168,
    "j": 169,
    "k": 170,
    "l": 171,
    "m": 172,
    "n": 173,
    "o": 174,
    "o++": 175,
    "o+-": 176,
    "o+o": 177,
    "o-+": 178,
    "o--": 179,
    "o-o": 180,
    "oo+": 181,
    "oo-": 182,
    "ooo": 183,
    "s": 184,
    "t": 185,
    "u": 186,
    "v": 187,
    "w": 188,
    "x": 189,
    "y": 190,
    "z": 191
  },
  "itos": {
    "0": "+",
    "1": "+++",
    "2": "++-",
    "3": "++o",
    "4": "+-+",
    "5": "+--",
    "6": "+-o",
    "7": "+o+",
    "8": "+o-",
    "9": "+oo",
    "10": "-++",
    "11": "-+-",
    "12": "-+o",
    "13": "--+",
    "14": "---",
    "15": "--o",
    "16": "-o+",
    "17": "-o-",
    "18": "-oo",
    "19": "0",
    "20": "1",
    "21": "10",
    "22": "11",
    "23": "12",
    "24": "13",
    "25": "14",
    "26": "15",
    "27": "16",
    "28": "17",
    "29": "18",
    "30": "19",
    "31": "2",
    "32": "3",
    "33": "4",
    "34": "5",
    "35": "6",
    "36": "7",
    "37": "8",
    "38": "9",
    "39": "<",
    "40": ">",
    "41": "Ac",
    "42": "Ag",
    "43": "Al",
    "44": "Ar",
    "45": "As",
    "46": "Au",
    "47": "B",
    "48": "BBB",
    "49": "BBO",
    "50": "BFF",
    "51": "Ba",
    "52": "Be",
    "53": "Bi",
    "54": "Br",
    "55": "C",
    "56": "Ca",
    "57": "Cd",
    "58": "Ce",
    "59": "Cl",
    "60": "Co",
    "61": "Cr",
    "62": "Cs",
    "63": "Cu",
    "64": "DDB",
    "65": "DDD",
    "66": "DDF",
    "67": "DDO",
    "68": "DOB",
    "69": "DOD",
    "70": "DOF",
    "71": "DOO",
    "72": "Dy",
    "73": "ECC",
    "74": "Er",
    "75": "Eu",
    "76": "F",
    "77": "FBB",
    "78": "FBF",
    "79": "Fe",
    "80": "Ga",
    "81": "Gd",
    "82": "Ge",
    "83": "H",
    "84": "He",
    "85": "Hf",
    "86": "Hg",
    "87": "Ho",
    "88": "I",
    "89": "In",
    "90": "Ir",
    "91": "K",
    "92": "Kr",
    "93": "La",
    "94": "Li",
    "95": "Lu",
    "96": "Mg",
    "97": "Mn",
    "98": "Mo",
    "99": "N",
    "100": "Na",
    "101": "Nb",
    "102": "Nd",
    "103": "Ne",
    "104": "Ni",
    "105": "Np",
    "106": "O",
    "107": "OBB",
    "108": "OBZ",
    "109": "ODB",
    "110": "ODD",
    "111": "ODO",
    "112": "OOB",
    "113": "OOC",
    "114": "OOD",
    "115": "OOE",
    "116": "OOO",
    "117": "OYZ",
    "118": "Os",
    "119": "P",
    "120": "Pa",
    "121": "Pb",
    "122": "Pd",
    "123": "Pm",
    "124": "Pr",
    "125": "Pt",
    "126": "Pu",
    "127": "Rb",
    "128": "Re",
    "129": "Rh",
    "130": "Ru",
    "131": "S",
    "132": "Sb",
    "133": "Sc",
    "134": "Se",
    "135": "Si",
    "136": "Sm",
    "137": "Sn",
    "138": "Sr",
    "139": "Ta",
    "140": "Tb",
    "141": "Tc",
    "142": "Te",
    "143": "Th",
    "144": "Ti",
    "145": "Tl",
    "146": "Tm",
    "147": "U",
    "148": "V",
    "149": "W",
    "150": "Xe",
    "151": "Y",
    "152": "YBO",
    "153": "YBY",
    "154": "YYO",
    "155": "YYY",
    "156": "Yb",
    "157": "ZZZ",
    "158": "Zn",
    "159": "Zr",
    "160": "a",
    "161": "b",
    "162": "c",
    "163": "d",
    "164": "e",
    "165": "f",
    "166": "g",
    "167": "h",
    "168": "i",
    "169": "j",
    "170": "k",
    "171": "l",
    "172": "m",
    "173": "n",
    "174": "o",
    "175": "o++",
    "176": "o+-",
    "177": "o+o",
    "178": "o-+",
    "179": "o--",
    "180": "o-o",
    "181": "oo+",
    "182": "oo-",
    "183": "ooo",
    "184": "s",
    "185": "t",
    "186": "u",
    "187": "v",
    "188": "w",
    "189": "x",
    "190": "y",
    "191": "z"
  }
}