{
  "stoi": {
    "+": 0,
    "+++": 1,
    "++-": 2,
    "++o": 3,
    "+-+": 4,
    "+--": 5,
    "+-o": 6,
    "+o+": 7,
    "+o-": 8,
    "+oo": 9,
    "-++": 10,
    "-+-": 11,
    "-+o": 12,
    "--+": 13,
    "---": 14,
    "--o": 15,
    "-o+": 16,
    "-o-": 17,
    "-oo": 18,
    "0": 19,
    "1": 20,
    "10": 21,
    "11": 22,
    "12": 23,
    "13": 24,
    "14": 25,
    "15": 26,
    "16": 27,
    "17": 28,
    "18": 29,
    "19": 30,
    "2": 31,
    "3": 32,
    "4": 33,
    "5": 34,
    "6": 35,
    "7": 36,
    "8": 37,
    "9": 38,
    "<": 39,
    ">": 40,
    "Ac": 41,
    "Ag": 42,
    "Al": 43,
    "As": 44,
    "Au": 45,
    "B": 46,
    "BBB": 47,
    "BBO": 48,
    "Ba": 49,
    "Be": 50,
    "Bi": 51,
    "Br": 52,
    "C": 53,
    "Ca": 54,
    "Cd": 55,
    "Ce": 56,
    "Cl": 57,
    "Co": 58,
    "Cr": 59,
    "Cs": 60,
    "Cu": 61,
    "DDD": 62,
    "DDF": 63,
    "DDO": 64,
    "DOB": 65,
    "DOD": 66,
    "DOF": 67,
    "DOO": 68,
    "Dy": 69,
    "ECC": 70,
    "Er": 71,
    "Eu": 72,
    "F": 73,
    "FBF": 74,
    "Fe": 75,
    "Ga": 76,
    "Gd": 77,
    "Ge": 78,
    "H": 79,
    "He": 80,
    "Hf": 81,
    "Hg": 82,
    "Ho": 83,
    "I": 84,
    "In": 85,
    "Ir": 86,
    "K": 87,
    "Kr": 88,
    "La": 89,
    "Li": 90,
    "Lu": 91,
    "Mg": 92,
    "Mn": 93,
    "Mo": 94,
    "N": 95,
    "Na": 96,
    "Nb": 97,
    "Nd": 98,
    "Ni": 99,
    "Np": 100,
    "O": 101,
    "OBZ": 102,
    "ODB": 103,
    "ODD": 104,
    "ODO": 105,
    "OOC": 106,
    "OOD": 107,
    "OOE": 108,
    "OOO": 109,
    "OYZ": 110,
    "Os": 111,
    "P": 112,
    "Pa": 113,
    "Pb": 114,
    "Pd": 115,
    "Pm": 116,
    "Pr": 117,
    "Pt": 118,
    "Pu": 119,
    "Rb": 120,
    "Re": 121,
    "Rh": 122,
    "Ru": 123,
    "S": 124,
    "Sb": 125,
    "Sc": 126,
    "Se": 127,
    "Si": 128,
    "Sm": 129,
    "Sn": 130,
    "Sr": 131,
    "Ta": 132,
    "Tb": 133,
    "Tc": 134,
    "Te": 135,
    "Th": 136,
    "Ti": 137,
    "Tl": 138,
    "Tm": 139,
    "U": 140,
    "V": 141,
    "W": 142,
    "Y": 143,
    "YBO": 144,
    "YYO": 145,
    "YYY": 146,
    "Yb": 147,
    "ZZZ": 148,
    "Zn": 149,
    "Zr": 150,
    "a": 151,
    "b": 152,
    "c": 153,
    "d": 154,
    "e": 155,
    "f": 156,
    "g": 157,
    "h": 158,
    "i": 159,
    "j": 160,
    "k": 161,
    "l": 162,
    "m": 163,
    "n": 164,
    "o": 165,
    "o++": 166,
    "o+-": 167,
    "o+o": 168,
    "o-+": 169,
    "o--": 170,
    "o-o": 171,
    "oo+": 172,
    "oo-": 173,
    "ooo": 174,
    "s": 175,
    "t": 176,
    "u": 177,
    "v": 178,
    "w": 179,
    "x": 180,
    "y": 181,
    "z": 182
  },
  "itos": {
    "0": "+",
    "1": "+++",
    "2": "++-",
    "3": "++o",
    "4": "+-+",
    "5": "+--",
    "6": "+-o",
    "7": "+o+",
    "8": "+o-",
    "9": "+oo",
    "10": "-++",
    "11": "-+-",
    "12": "-+o",
    "13": "--+",
    "14": "---",
    "15": "--o",
    "16": "-o+",
    "17": "-o-",
    "18": "-oo",
    "19": "0",
    "20": "1",
    "21": "10",
    "22": "11",
    "23": "12",
    "24": "13",
    "25": "14",
    "26": "15",
    "27": "16",
    "28": "17",
    "29": "18",
    "30": "19",
    "31": "2",
    "32": "3",
    "33": "4",
    "34": "5",
    "35": "6",
    "36": "7",
    "37": "8",
    "38": "9",
    "39": "<",
    "40": ">",
    "41": "Ac",
    "42": "Ag",
    "43": "Al",
    "44": "As",
    "45": "Au",
    "46": "B",
    "47": "BBB",
    "48": "BBO",
    "49": "Ba",
    "50": "Be",
    "51": "Bi",
    "52": "Br",
    "53": "C",
    "54": "Ca",
    "55": "Cd",
    "56": "Ce",
    "57": "Cl",
    "58": "Co",
    "59": "Cr",
    "60": "Cs",
    "61": "Cu",
    "62": "DDD",
    "63": "DDF",
    "64": "DDO",
    "65": "DOB",
    "66": "DOD",
    "67": "DOF",
    "68": "DOO",
    "69": "Dy",
    "70": "ECC",
    "71": "Er",
    "72": "Eu",
    "73": "F",
    "74": "FBF",
    "75": "Fe",
    "76": "Ga",
    "77": "Gd",
    "78": "Ge",
    "79": "H",
    "80": "He",
    "81": "Hf",
    "82": "Hg",
    "83": "Ho",
    "84": "I",
    "85": "In",
    "86": "Ir",
    "87": "K",
    "88": "Kr",
    "89": "La",
    "90": "Li",
    "91": "Lu",
    "92": "Mg",
    "93": "Mn",
    "94": "Mo",
    "95": "N",
    "96": "Na",
    "97": "Nb",
    "98": "Nd",
    "99": "Ni",
    "100": "Np",
    "101": "O",
    "102": "OBZ",
    "103": "ODB",
    "104": "ODD",
    "105": "ODO",
    "106": "OOC",
    "107": "OOD",
    "108": "OOE",
    "109": "OOO",
    "110": "OYZ",
    "111": "Os",
    "112": "P",
    "113": "Pa",
    "114": "Pb",
    "115": "Pd",
    "116": "Pm",
    "117": "Pr",
    "118": "Pt",
    "119": "Pu",
    "120": "Rb",
    "121": "Re",
    "122": "Rh",
    "123": "Ru",
    "124": "S",
    "125": "Sb",
    "126": "Sc",
    "127": "Se",
    "128": "Si",
    "129": "Sm",
    "130": "Sn",
    "131": "Sr",
    "132": "Ta",
    "133": "Tb",
    "134": "Tc",
    "135": "Te",
    "136": "Th",
    "137": "Ti",
    "138": "Tl",
    "139": "Tm",
    "140": "U",
    "141": "V",
    "142": "W",
    "143": "Y",
    "144": "YBO",
    "145": "YYO",
    "146": "YYY",
    "147": "Yb",
    "148": "ZZZ",
    "149": "Zn",
    "150": "Zr",
    "151": "a",
    "152": "b",
    "153": "c",
    "154": "d",
    "155": "e",
    "156": "f",
    "157": "g",
    "158": "h",
    "159": "i",
    "160": "j",
    "161": "k",
    "162": "l",
    "163": "m",
    "164": "n",
    "165": "o",
    "166": "o++",
    "167": "o+-",
    "168": "o+o",
    "169": "o-+",
    "170": "o--",
    "171": "o-o",
    "172": "oo+",
    "173": "oo-",
    "174": "ooo",
    "175": "s",
    "176": "t",
    "177": "u",
    "178": "v",
    "179": "w",
    "180": "x",
    "181": "y",
    "182": "z"
  }
}